VuongSun/STM8S003F3/FWLib/include/STM8_TSL_RC_MultiChannelKey.c
    /* Ignore channel if too much noise is detected */
    if (pMCKeyStruct->Channel[ChannelIndex].LastMeasRejectNb > MAX_REJECTED_MEASUREMENTS)
    {
      break;
    }
    
    TSL_MCKey_DeltaCalculation( ChannelIndex );
    
    if ( Delta <= pMCKeyStruct->RecalibrationThreshold )
    {
      TSL_MCKey_SetPreRecalibrationState( );
      return;
    }
    
  }

  /* Check all channels to enter in Pre-detect state if needed */ 
  for ( ChannelIndex = 0; ChannelIndex < CHANNEL_PER_MCKEY; ChannelIndex++ )
  {
    
    /* Ignore channel if too much noise is detected */
    if (pMCKeyStruct->Channel[ChannelIndex].LastMeasRejectNb > MAX_REJECTED_MEASUREMENTS)
    {
      break;
    }
    
    TSL_MCKey_DeltaCalculation( ChannelIndex );
    
    if ( Delta >= pMCKeyStruct->DetectThreshold )
    {
      TSL_MCKey_SetPreDetectState( );
      if ( !DetectionIntegrator )
      {
        pMCKeyStruct->Channel[0].IntegratorCounter++;
        TSL_MCKey_PreDetectTreatment( );
      }
      return;
    }
    
  }

}


/**
  ******************************************************************************
  * @brief Check MCKey info during PRE DETECT state: Verify detection integrator and detection exclusion.
  * @par Parameters:
  * None
  * @retval void None
  * @par Required preconditions:
  * None
  ******************************************************************************
  */
void TSL_MCKey_PreDetectTreatment(void)
{

  u8 ConditionLeaveDetect = 1; /* Per default we go back to idle state */

  /* Go back in idle state if ALL channels are below the detect threshold */
  for ( ChannelIndex = 0; ChannelIndex < CHANNEL_PER_MCKEY; ChannelIndex++ )
  {
    TSL_MCKey_DeltaCalculation( ChannelIndex );
    if ((pMCKeyStruct->Channel[ChannelIndex].LastMeasRejectNb <= MAX_REJECTED_MEASUREMENTS) &&
       (Delta >= pMCKeyStruct->DetectThreshold))
    {
      ConditionLeaveDetect = 0;
      break;
    }
  }

  if ( ConditionLeaveDetect )
  {
    TSL_MCKey_BackToIdleState( );
    return;
  }
  else
  {
    TSL_MCKey_DES( );
    pMCKeyStruct->Channel[0].IntegratorCounter--;
    if ( !pMCKeyStruct->Channel[0].IntegratorCounter )
    {
      TSL_MCKey_Position( );
      TSL_MCKey_SetDetectedState( );
    }
  }

}


/**
  ******************************************************************************
  * @brief Check MCKey info during DETECTED state:
  * Verify detection timeout, end of detection and detection exclusion.
  * @par Parameters:
  * None
  * @retval void None
  * @par Required preconditions:
  * None
  ******************************************************************************
  */
void TSL_MCKey_DetectedTreatment(void)
{

  u8 ConditionLeaveDetect = 1;

  /* Go in post-detect state if ALL channels are below or equal the end-detect threshold */
  for ( ChannelIndex = 0; ChannelIndex < CHANNEL_PER_MCKEY; ChannelIndex++ )
  {
    TSL_MCKey_DeltaCalculation( ChannelIndex );
    if ((pMCKeyStruct->Channel[ChannelIndex].LastMeasRejectNb <= MAX_REJECTED_MEASUREMENTS) &&
        (Delta > pMCKeyStruct->EndDetectThreshold))
    {
      ConditionLeaveDetect = 0;
      break;
    }
  }
  
  if ( ConditionLeaveDetect )
  {
    TSL_MCKey_SetPostDetectState( );
    if ( !EndDetectionIntegrator )
    {
      pMCKeyStruct->Channel[0].IntegratorCounter++;
      TSL_MCKey_PostDetectTreatment( );
    }
    return;
  }

  /* Detection TimeOut only if there is no change in the slider/wheel position */
  if (TSL_MCKey_Position() == 0x00)
  {
    TSL_MCKey_DetectionTimeout( );
  }

}


/**
  ******************************************************************************
  * @brief Check MCKey info during POST DETECT state: Verify end of detection.
  * @par Parameters:
  * None
  * @retval void None
  * @par Required preconditions:
  * None
  ******************************************************************************
  */
void TSL_MCKey_PostDetectTreatment(void)
{

  u8 ConditionLeaveDetect = 1;

  /* Go in idle state if ALL channels are below or equal the end-detect threshold */
  for ( ChannelIndex = 0; ChannelIndex < CHANNEL_PER_MCKEY; ChannelIndex++ )
  {
    TSL_MCKey_DeltaCalculation( ChannelIndex );
    if ((pMCKeyStruct->Channel[ChannelIndex].LastMeasRejectNb <= MAX_REJECTED_MEASUREMENTS) &&
        (Delta > pMCKeyStruct->EndDetectThreshold))
    {
      ConditionLeaveDetect = 0;
      break;
    }
  }

  if ( ConditionLeaveDetect )
  {
    pMCKeyStruct->Channel[0].IntegratorCounter--;
    if ( !pMCKeyStruct->Channel[0].IntegratorCounter )
    {
      TSL_MCKey_SetIdleState( );
    }
  }
  else
  {
    // No reset of DTO counter.
    TSL_MCKey_BackToDetectedState( );
  }
}


/**
  ******************************************************************************
  * @brief Check MCKey info during PRE RECALIBRATION state: Verify condition for recalibration.
  * @par Parameters:
  * None
  * @retval void None
  * @par Required preconditions:
  * None
  ******************************************************************************
  */
void TSL_MCKey_PreRecalibrationTreatment(void)
{

  u8 ConditionLeaveCalib = 1;

  /* Go in calibration state if at least ONE channel is below the calibration threshold */
  for ( ChannelIndex = 0; ChannelIndex < CHANNEL_PER_MCKEY; ChannelIndex++ )
  {
    TSL_MCKey_DeltaCalculation( ChannelIndex );
    if ((pMCKeyStruct->Channel[ChannelIndex].LastMeasRejectNb <= MAX_REJECTED_MEASUREMENTS) &&
        (Delta <= pMCKeyStruct->RecalibrationThreshold))
    {
      ConditionLeaveCalib = 0;
      break;
    }
  }

  if ( !ConditionLeaveCalib )
  {
    pMCKeyStruct->Channel[0].IntegratorCounter--;
    if ( !pMCKeyStruct->Channel[0].IntegratorCounter )
    {
      TSL_MCKey_SetCalibrationState( );
    }
  }
  else
  {
    TSL_MCKey_BackToIdleState( );
  }

}


/**
  ******************************************************************************
  * @brief During calibration, calculates the new reference.
  * @par Parameters:
  * None
  * @retval void None
  * @par Required preconditions:
  * None
  ******************************************************************************
  */
void TSL_MCKey_CalibrationTreatment(void)
{

  for ( ChannelIndex = 0; ChannelIndex < CHANNEL_PER_MCKEY; ChannelIndex++ )
  {
    if (pMCKeyStruct->Channel[ChannelIndex].LastMeasRejectNb <= MAX_REJECTED_MEASUREMENTS)
    {
      pMCKeyStruct->Channel[ChannelIndex].Reference += pMCKeyStruct->Channel[ChannelIndex].LastMeas;
    }
    else
    {
      return;
    }
  }
  
  pMCKeyStruct->Counter--;
  
  if ( !pMCKeyStruct->Counter )
  {
    for ( ChannelIndex = 0; ChannelIndex < CHANNEL_PER_MCKEY; ChannelIndex++ )
    {
      // Warning: Must be divided by MCKEY_CALIBRATION_COUNT_DEFAULT !!!
      pMCKeyStruct->Channel[ChannelIndex].Reference = (pMCKeyStruct->Channel[ChannelIndex].Reference >> 3);
    }
    TSL_MCKey_SetIdleState( );
  }

